In [1]:
# Import your data into a Pandas DataFrame.
# Merge your DataFrames.
# Create a bubble chart that showcases the average fare versus the total number of rides with bubble size based on the total number of drivers for each city type, including urban, suburban, and rural.
# Determine the mean, median, and mode for the following:
# The total number of rides for each city type.
# The average fares for each city type.
# The total number of drivers for each city type.
# Create box-and-whisker plots that visualize each of the following to determine if there are any outliers:
# The number of rides for each city type.
# The fares for each city type.
# The number of drivers for each city type.
# Create a pie chart that visualizes each of the following data for each city type:
# The percent of total fares.
# The percent of total rides.
# The percent of total drivers.

In [2]:
# make sure the plots display in the cells 
%matplotlib inline

# Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

# # Load in csv
# pyber_ride_df = pd.read_csv("resources/PyBer_ride_data.csv")
# pyber_ride_df

In [3]:
#load files 
city_data_to_load = "resources/city_data.csv"
ride_data_to_load = "resources/ride_data.csv"

In [4]:
#read csv files into a DataFrame 
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [5]:
# read ride_data.csv file into a DataFrame 
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(5)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [6]:
# #plot months on the x_axis, avg fare on the y_axis 
# pyber_ride_df.plot(x="Month", y="Avg. Fare ($USD)")
# plt.show()

In [7]:
#inspect data to make sure that non of the columns have null values 
# starting with the city_data.csv
# Get all the rows that contain null values.
# use count() or chain together isnull().sum()
city_data_df.count()
# city_data_df.isnull().sum()

# Find out how many data points there are for each type of city.

city            120
driver_count    120
type            120
dtype: int64

In [8]:
# Make sure the driver_count column has an integer data type.
#get the data type of each column 
# this property doesnt need (), will get error if added () in
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [9]:
# Find out how many data points there are for each type of city.
# find out the city type first 
# use the unique to get all the unique values of the "type" column for city types. 
# this will return an array / list of the city types 

city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [10]:
# Find out how many data points there are for each type of city.
# use sum() method on the df for the 'type' column 
# can't have all of them in one cell :(

sum(city_data_df["type"] =="Urban")
# sum(city_data_df["type"] =="Suburban")
# sum(city_data_df["type"] =="Rural")

66

In [11]:
sum(city_data_df["type"] =="Suburban")

36

In [12]:
sum(city_data_df["type"] =="Rural")

18

In [13]:
#inspect the ride df 
#find out if there are null values in the df 

ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [14]:
#inspect the ride df 
# find out the datatypes of each column 
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [15]:
#merge the dfs 
# they share the same "city" column 
#the syntax to merge df: new_df = pd.merge(leftdf, rightdf, on=["column_leftdf", "column_rightdf"])
#how= parameter indicates if we want to merge L, R, inner, or outer, the dafault is inner 


city_ride_df = pd.merge(ride_data_df, city_data_df, how = "left", on = ["city", "city"])

city_ride_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [16]:
# still not too sure what the 'how=' parameter does... 
# city_ride_df = pd.merge(ride_data_df, city_data_df, how = "inner", on = ["city", "city"])
# city_ride_df

In [17]:
# For the bubble chart, we will need to plot the following:
# The average fare for each type of city on the y-axis
# The total number of rides for each type city on the x-axis
# Make the size of each marker, or bubble, correlate to the average number of drivers for each type of city

In [18]:
#first get the average for each city type 
#create df for each city type: urban, suburban, and rural 

urban_cities_df = city_ride_df[city_ride_df["type"]=="Urban"]
urban_cities_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
1620,Reynoldsfurt,2019-02-14 11:25:10,39.40,9070692324754,67,Urban
1621,Christopherfurt,2019-03-13 01:47:52,32.05,2788817929605,41,Urban
1622,Raymondhaven,2019-03-20 02:20:34,38.53,8658255136559,11,Urban
1623,Port Johnbury,2019-03-26 07:22:45,7.63,8089282605778,3,Urban
1624,West Gabriel,2019-05-05 01:24:06,27.57,4428773411209,57,Urban

In [24]:
#create df for each city type: suburban

suburban_cities_df = city_ride_df[city_ride_df["type"] =="Suburban"]
suburban_cities_df

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,2019-01-27 03:08:01,27.79,6653622887913,11,Suburban
1626,East Kentstad,2019-04-07 19:44:19,18.75,6575961095852,20,Suburban
1627,Lake Omar,2019-01-17 21:33:35,21.71,966911700371,22,Suburban
1628,Myersshire,2019-02-27 17:38:39,17.10,5706770909868,19,Suburban
1629,West Hannah,2019-04-19 01:06:59,37.78,2273047151891,12,Suburban
...,...,...,...,...,...,...
2245,West Hannah,2019-03-02 17:06:03,13.92,7388937249208,12,Suburban
2246,Lake Robertside,2019-04-03 03:27:45,12.76,1301757653884,4,Suburban
2247,Colemanland,2019-01-10 06:49:58,27.70,8704067171414,23,Suburban
2248,East Marymouth,2019-02-12 23:18:53,47.41,7409660239158,5,Suburban
2249,New Raymond,2019-02-11 17:28:27,17.97,7551674475043,17,Suburban

In [23]:
#create df for each city type: rural 
rural_cities_df = city_ride_df[city_ride_df["type"] == "Rural"]
rural_cities_df.head()

,city,date,fare,ride_id,driver_count,type
2250,Randallchester,2019-04-13 11:13:31,43.22,1076079536213,9,Rural
2251,North Holly,2019-02-02 14:54:00,12.42,1985256326182,8,Rural
2252,Michaelberg,2019-03-27 18:27:34,54.85,4421836952718,6,Rural
2253,Lake Latoyabury,2019-02-23 21:12:24,47.90,3269652929887,2,Rural
2254,Lake Latoyabury,2019-05-06 08:57:56,51.80,4018025271936,2,Rural

In [25]:
#get the number of rides per city type
#create a series where the city type is the index then use count() 

# Get the number of rides for urban cities.
urban_ride_count = urban_cities_df.groupby(["city"]).count()["ride_id"]
urban_ride_count.head()

city
Amandaburgh        18
Barajasview        22
Carriemouth        27
Christopherfurt    27
Deanville          19
Name: ride_id, dtype: int64

In [31]:
#get the number of rides for suburban cities 
suburban_ride_count = suburban_cities_df.groupby(["city"]).count()["ride_id"]
suburban_ride_count.head()

city
Barronchester    16
Bethanyland      18
Brandonfort      19
Colemanland      22
Davidfurt        17
Name: ride_id, dtype: int64

In [32]:
#get the number of rides for rural cities 
rural_ride_count = rural_cities_df.groupby(["city"]).count()["ride_id"]
rural_ride_count.head()

city
Bradshawfurt      10
Garzaport          3
Harringtonfort     6
Jessicaport        6
Lake Jamie         6
Name: ride_id, dtype: int64

In [33]:
#find the average fare cost for each city type
#find the average fare cost for urban 
urban_ride_avg = urban_cities_df.groupby(["city"]).mean()["fare"]
urban_ride_avg.head()

city
Amandaburgh        24.641667
Barajasview        25.332273
Carriemouth        28.314444
Christopherfurt    24.501852
Deanville          25.842632
Name: fare, dtype: float64

In [34]:
suburban_ride_avg = suburban_cities_df.groupby(["city"]).mean()["fare"]
suburban_ride_avg.head()

city
Barronchester    36.422500
Bethanyland      32.956111
Brandonfort      35.437368
Colemanland      30.894545
Davidfurt        31.995882
Name: fare, dtype: float64

In [35]:
rural_ride_avg = rural_cities_df.groupby(["city"]).mean()["fare"]
rural_ride_avg.head()

city
Bradshawfurt      40.064000
Garzaport         24.123333
Harringtonfort    33.470000
Jessicaport       36.013333
Lake Jamie        34.358333
Name: fare, dtype: float64

In [36]:
#find the avg # of drivers per city type 
urban_drivers_avg = urban_cities_df.groupby(["city"]).mean()["driver_count"]
urban_drivers_avg.head()

city
Amandaburgh        12.0
Barajasview        26.0
Carriemouth        52.0
Christopherfurt    41.0
Deanville          49.0
Name: driver_count, dtype: float64

In [ ]:
suburban_drivers_avg = suburban_cities_df.groupby(["city"]).mean()["driver_count"]
suburban_drivers_avg.head()